task = """

2. Реализовать примеры с functools - wraps и singledispatch

"""

print(task)